; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph2 - mode
	infrared6 - mode
	spectrograph0 - mode
	image1 - mode
	image5 - mode
	infrared3 - mode
	spectrograph4 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation8 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph4)
	(supports instrument0 image5)
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared6)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
)
(:goal (and
	(pointing satellite0 GroundStation8)
	(have_image Star9 infrared3)
	(have_image Star9 spectrograph0)
	(have_image Planet10 infrared3)
	(have_image Planet10 spectrograph0)
	(have_image Planet11 spectrograph0)
	(have_image Star12 image1)
	(have_image Star12 thermograph2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
2. (turn_to satellite0 groundstation7 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 groundstation8 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 groundstation8)
   goals met: 1 of 8
5. (turn_to satellite0 planet10 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 planet10)
   goals met: 0 of 8
6. (take_image satellite0 planet10 instrument0 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 1 of 8
7. (take_image satellite0 planet10 instrument0 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 2 of 8
8. (turn_to satellite0 groundstation8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation8)
   goals met: 3 of 8
9. (turn_to satellite0 planet11 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 planet11)
   goals met: 2 of 8
10. (take_image satellite0 planet11 instrument0 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 3 of 8
11. (turn_to satellite0 groundstation8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation8)
   goals met: 4 of 8
12. (turn_to satellite0 star12 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 star12)
   goals met: 3 of 8
13. (take_image satellite0 star12 instrument0 image1)
   added: (have_image star12 image1)
   goals met: 4 of 8
14. (take_image satellite0 star12 instrument0 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 5 of 8
15. (turn_to satellite0 groundstation8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation8)
   goals met: 6 of 8
16. (turn_to satellite0 star9 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 star9)
   goals met: 5 of 8
17. (take_image satellite0 star9 instrument0 infrared3)
   added: (have_image star9 infrared3)
   goals met: 6 of 8
18. (take_image satellite0 star9 instrument0 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 7 of 8
19. (turn_to satellite0 groundstation8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation8)
   goals met: 8 of 8
